use crate::q::Solution;

#[allow(unused)]
impl Solution {
    pub fn find_special_integer(arr: Vec<i32>) -> i32 {
        // 方法1：创建hashmap，将arr[i]作为key，出现次数作为值存储到hashmap中，统计个数超过arr.len() * 0.25的
        // Passed 0ms 2.7mb
        // let mut map = std::collections::HashMap::new();
        // for i in 0..arr.len() {
        //     let entry = map.entry(arr[i]).or_insert(0);
        //     *entry += 1;
        // }
        // match map.iter().find(|item| *item.1 * 4 > arr.len()) {
        //     Some(item) => *item.0,
        //     None => -1
        // }

        // 方法2：注意到arr是有序的，所以我们可以进行逐步统计，只要有大于阈值的，直接就返回
        // Passed 0ms 2.2mb
        // let mut cur = (0, 0);
        // for n in arr.iter() {
        //     if *n == cur.0 { cur.1 += 1; } else { cur = (*n, 1); }
        //     if cur.1 * 4 > arr.len() { return cur.0; }
        // }
        // -1

        // 方法3：注意到数字是大于25%的，那即意味着当前数字和25%长度的距离内的数字是相等的
        let threshold = arr.len() / 4;
        for i in 0..arr.len() {
            if arr[i + threshold] == arr[i] { return arr[i]; }
        }
        -1
    }
}

#[test]
fn test_q1287() {
    assert_eq!(6, Solution::find_special_integer(vec![1, 2, 2, 6, 6, 6, 6, 7, 10]));
    assert_eq!(1, Solution::find_special_integer(vec![1]));
    assert_eq!(1, Solution::find_special_integer(vec![1, 1]));
    assert_eq!(0, Solution::find_special_integer(vec![0, 0, 1]));
    assert_eq!(6, Solution::find_special_integer(vec![1, 2, 2, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 7, 10]));
}